package com.kuchuanyun.wisdomcitymanagement.gson;

/**
 * Description: 选择区域返回的json
 * Copyright  : Copyright (c) 2017
 * Company    : 酷川科技 www.kuchuanyun.com
 * Author     : 李小松
 * Date       : 2017/10/15 on 20:12.
 */

public class ChooseAreaInfo {

    /**
     * code : -101
     * id : 3414
     * name : 龙里县冠山街道办事处金龙东路70号龙城国际负1-1潮流前线
     * pId : 1307
     * remarks : 龙里县冠山街道办事处金龙东路70号龙城国际负1-1潮流前线
     * type : 未知
     * open : true
     * <p>
     * [{"code":"-101","name":"龙里县冠山街道办事处金龙东路70号龙城国际负1-1潮流前线","pId":"1307","id":"3414",
     * "type":"未知","remarks":"龙里县冠山街道办事处金龙东路70号龙城国际负1-1潮流前线"},{"code":"-102",
     * "name":"龙里县冠山街道办事处金龙东路70号龙城国际负1-2孕喜爱","pId":"1307","id":"3415","type":"未知",
     * "remarks":"龙里县冠山街道办事处金龙东路70号龙城国际负1-2孕喜爱"},{"code":"-103",
     * "name":"龙里县冠山街道办事处金龙东路70号龙城国际负1-3华联超市","pId":"1307","id":"3416","type":"未知",
     * "remarks":"龙里县冠山街道办事处金龙东路70号龙城国际负1-3华联超市"},{"code":"-104",
     * "name":"龙里县冠山街道办事处金龙东路70号龙城国际负1-4黔晋福","pId":"1307","id":"3417","type":"未知",
     * "remarks":"龙里县冠山街道办事处金龙东路70号龙城国际负1-4黔晋福"},{"code":"-105",
     * "name":"龙里县冠山街道办事处金龙东路70号龙城国际负1-5老凤祥","pId":"1307","id":"3418","type":"未知",
     * "remarks":"龙里县冠山街道办事处金龙东路70号龙城国际负1-5老凤祥"},{"code":"-106",
     * "name":"龙里县冠山街道办事处金龙东路70号龙城国际负1-6HONGU包店","pId":"1307","id":"3419","type":"未知",
     * "remarks":"龙里县冠山街道办事处金龙东路70号龙城国际负1-6HONGU包店"},{"code":"-108",
     * "name":"龙里县冠山街道办事处金龙东路70号龙城国际负1-8仟丝缘","pId":"1307","id":"3421","type":"未知",
     * "remarks":"龙里县冠山街道办事处金龙东路70号龙城国际负1-8仟丝缘"},{"code":"-109",
     * "name":"龙里县冠山街道办事处金龙东路70号龙城国际负1-9健康内衣","pId":"1307","id":"3422","type":"未知",
     * "remarks":"龙里县冠山街道办事处金龙东路70号龙城国际负1-9健康内衣"},{"code":"-110",
     * "name":"龙里县冠山街道办事处金龙东路70号龙城国际负1-10孕妇世界","pId":"1307","id":"3423","type":"未知",
     * "remarks":"龙里县冠山街道办事处金龙东路70号龙城国际负1-10孕妇世界"},{"code":"-111",
     * "name":"龙里县冠山街道办事处金龙东路70号龙城国际负1-11烟草店","pId":"1307","id":"3424","type":"未知",
     * "remarks":"龙里县冠山街道办事处金龙东路70号龙城国际负1-11烟草店"},{"code":"-112",
     * "name":"龙里县冠山街道办事处金龙东路70号龙城国际负1-12晶隆小家电","pId":"1307","id":"3425","type":"未知",
     * "remarks":"龙里县冠山街道办事处金龙东路70号龙城国际负1-12晶隆小家电"},{"code":"-113",
     * "name":"龙里县冠山街道办事处金龙东路70号龙城国际负1-13艾玲珑","pId":"1307","id":"3426","type":"未知",
     * "remarks":"龙里县冠山街道办事处金龙东路70号龙城国际负1-13艾玲珑"},{"code":"-114",
     * "name":"龙里县冠山街道办事处金龙东路70号龙城国际负1-14稀奇古怪","pId":"1307","id":"3427","type":"未知",
     * "remarks":"龙里县冠山街道办事处金龙东路70号龙城国际负1-14稀奇古怪"},{"code":"-115",
     * "name":"龙里县冠山街道办事处金龙东路70号龙城国际负1-15表（ 罗西尼、卡迪森）","pId":"1307","id":"3428","type":"未知",
     * "remarks":"龙里县冠山街道办事处金龙东路70号龙城国际负1-15表（ 罗西尼、卡迪森）"},{"code":"-116",
     * "name":"龙里县冠山街道办事处金龙东路70号龙城国际负1-16阿尔皮纳袋鼠","pId":"1307","id":"3429","type":"未知",
     * "remarks":"龙里县冠山街道办事处金龙东路70号龙城国际负1-16阿尔皮纳袋鼠"}]
     */

    public String code;
    public int id;
    public String name;
    public int pId;
    public String remarks;
    public String type;
    public String open;
}
