https://www.imooc.com/video/16779
3.5.NAL单元详解

1.NALU(Network Abstraction Layer Unit),网络抽象层单元
  NALU = NAL Header + NAL Body,
  
1.NAL Header
  占一个字节,由3部分组成
  +---------------+
  |0|1|2|3|4|5|6|7|
  +-+-+-+-+-+-+-+-+
  |F|NRI|  Type   |
  +---------------+
  1.F位: 禁止位,forbidden_zero_bit,在H.264规范中规定这一位必须为0
  2.NRI位:指示重要性, 00最不重要,11最重要, 写了这个规范,但暂无什么人用
  3.Type:这个NALU单元的类型 ↓

2.NAL Type(一)
  nal_unit_type		NAL类型							C
		0			未使用
		1			非IDR图像中不采用数据划分的片段	2,3,4
		2			非IDR图像中A类数据划分片段		2
		3			非IDR图像中B类数据划分片段		3
		4			非IDR图像中C类数据划分片段		4
		5			IDR图像的片						2,3
		6			补充增强信息单元(SEI)			5
		7			序列参数集(SPS)					0
		8			图像参数集(PPS)					1
		9			分界符							6
		10			序列结束						7
		11			码流结束						8
		12			填充							9
		13-23		保留
		24-31		不保留(RTP打包时会用到)

  需要关注的type:
      5: IDR图像的片, 一个H264帧由多个片组成, 5 表示I帧(关键帧),由多个I片组成,
	  7: 序列参数集, 就是SPS,见图3.1.3,存放参数、参考帧数目、解码图像尺寸、帧场编码模式选择标识 等, 
		 指导一组帧(GOF)
	  8: 图像参数集, 就是PPS,见图3.1.3,存放熵编码模式选择标识、片组数目、初始量化参数 和 去方块滤波系数调整标识 等,

3.NAL Type(二)
		0			没有定义
		1-23		NAL 单元		单个 NAL 单元包
		24			STAP-A			单一时间的组合包
		25			STAP-B			单一时间的组合包
		26			MTAP16			多个时间的组合包
		27			MTAP24			多个时间的组合包
		28			FU-A			分片的单元
		29			FU-B			分片的单元
		30-31		没有定义

  需要关注的type:
      28: 分片的单元
	  29: 分片的单元
	  
	      一个H264帧通过网络传输,每个包最大1500字节,一帧过大,需要切成多个片,
	      每一个包是一个片,最后进行组装
	  
4.NAL类型介绍
	在NAL类型中, 实际我们再划分,又分成了几大类.
	
	1.单一类型: 一个RTP包只包含一个NALU(一个H264帧由1个片组成,比如P帧,B帧)
	2.组合类型: 一个RTP包含多个NALU, 类型是 24-27,比如SPS,PPS都放在同一个RTP包里面
	3.分片类型: 一个NALU单元分成多个RTP包, 类型是28-29

	下面对4中类型做详细介绍

5.单一NALU的RTP包
     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |F|NRI|  type   |                                               |
    +-+-+-+-+-+-+-+-+                                               |
    |                                                               |
    |               Bytes 2..n of a Signle NAL unit                 |
    |                                                               |
    |                               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |                               :...OPTIONAL RTP padding        |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
	
	1.在这个RTP包里,第一个字节就是 NAL Header,
	
6.组合NALU的RTP包
     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |                          RTP Header                           |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-|
    |STAP-A NAL HDR |         NALU 1 Size           | NALU 1 HDR    |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-|
    |                         NALU 1 Data                           |
    :                                                               :
    +               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |               | NALU 2 Size                   | NALU 2 HDR    |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |                         NALU 2 Data                           |
    :                                                               :
    |                               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |                               :...OPTIONAL RTP padding        |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
	
	1.RTP Header
	2.body里包含:
	  STAP-A NAL HDR(NAL Header), NALU 1 Size(大小), NALU 1 HDR(NAL Header),
	  NALU 1 Data(数据)
	  NALU 2 Size(下一个包的大小), NALU 2 HDR(NAL Header), NALU 2 Data(数据)

7.分片NALU的RTP包
     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    | FU indicator  |   FU header   |                               |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               |
    |                                                               |
    |                         FU payload                            |
    |                                                               |
    |                               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |                               :...OPTIONAL RTP padding        |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    Figure 14.  RTP payload format for FU-A
	
	1.第一个字节是FU indicator,分片指示符
	2.第二个字节是FU header, 分片单元的Header,有多个片,就通过这个Header组装

8.FU Header
  占一个字节,由4部分组成
  +---------------+
  |0|1|2|3|4|5|6|7|
  +-+-+-+-+-+-+-+-+
  |S|E|R|  Type   |
  +---------------+

  S: start bit,用于指明分片的开始
  E: end bit,用于指明分片的结束
  R: 未使用,设置为0
  Type: 指明分片NAL类型,网络传输后组成分片NAL单元,NAL单元的类型(关键帧,非关键帧,pps,sps等).

  接收到包可能是乱序的,丢失的,怎么判断分片是否都到达?是否有序?是否能组成一个帧?
  就是通过 S位 和 E位 判断,当然还要借助RTP包的包头(包含了一个Sequence Number,每个包的序列号,递增),

